app/controllers/entry_controller.rb

  def complete
    @user = User.new( params[:user] )

    if @user.save
---
INSERT INTO "users" ("salt", "mail_address", "created_at", "updated_at", "hashed_password", "level", "twitter_id", "login_id", "display_name") VALUES('21949806600.826845486750088', NULL, '2011-02-13 15:40:41', '2011-02-13 15:40:41', '741951eb644e006f370e7cf60bebe8e5faf5ffeb', NULL, 'test', 'test6', 'テスト')

  def login
    @user = User.new( params[:login] )

    return if @user.blank?

    if !@user.login_id.blank? and !@user.password.blank?
      # ユーザ認証
      user = @user.authenticate

      unless user.blank?
        # ユーザID／ログインIDをセッションに格納
        session[:user_id] = user.id
        session[:login_id] = user.login_id

    result = Schedule.update_all( ["user_id = ?", session[:user_id]] )
---
SELECT * FROM "users" WHERE ("users"."login_id" = 'test') LIMIT 1
UPDATE "schedules" SET user_id = :user_id WHERE ("schedules"."user_id" IS NULL)

  def show
    @user = User.find_by_id( session[:user_id] )
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def edit
    @user = User.find_by_id( session[:user_id] )
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def update
    @user = User.find_by_id( session[:user_id] )
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

    end

    # ユーザ情報を更新
    if @user.update_attributes( params[:user] )
---
UPDATE "users" SET "updated_at" = '2011-02-13 16:10:03', "salt" = '21945037000.87269715648367', "hashed_password" = '0ae82c8060af78cfaf69ee7c633f9e2a275f1d95', "display_name" = 'テスト', "twitter_id" = 'test' WHERE "id" = 1