app/controllers/schedules_controller.rb

SELECT * FROM "schedules" WHERE ( user_id = 1 ) ORDER BY schedule_date DESC, id ASC LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM "schedules" WHERE ( user_id = 1 )
---
  def list
    @now_date = Date.parse( params[:date] )
    @schedules = Schedule.paginate( :page => params[:page], :per_page => 10, :order => "schedule_date DESC, id ASC" )

SELECT * FROM "schedules" WHERE ("schedules"."id" = 1)
---
  def show
    @now_date = Date.parse( params[:date] )
    @schedule = Schedule.find( params[:id] ) unless params[:id].blank?

SELECT * FROM "schedules" WHERE ("schedules"."id" = 1)
---
  def edit
    @now_date = Date.parse( params[:date] )
    @schedule = Schedule.find( params[:id] ) unless params[:id].blank?

INSERT INTO "schedules" ("created_at", "end_time", "title", "schedule_date", "updated_at", "mode", "user_id", "note", "cycle", "cycle_mode", "start_time") VALUES('2011-02-12 13:55:50', '2011-02-12 00:00:00', 'TEST', '2011-02-10', '2011-02-12 13:55:50', '公開', NULL, '', 1, 'day', '2011-02-12 00:00:00')
---
  def create
    @now_date = Date.parse( params[:date] )
    @schedule = Schedule.new( params[:schedule] )

    if @schedule.save

SELECT * FROM "schedules" WHERE ("schedules"."id" = 7)
UPDATE "schedules" SET "start_time" = '2011-02-13 00:00:00', "updated_at" = '2011-02-13 08:14:47', "mode" = '公開', "end_time" = '2011-02-13 00:00:00' WHERE "id" = 1
---
  def update
    @now_date = Date.parse( params[:date] )
    @schedule = Schedule.find( params[:id] ) unless params[:id].blank?

print "【 Date.valid_date? 】>> " ; p Date.valid_date?( params[:schedule]["schedule_date(1i)"].to_i, params[:schedule]["schedule_date(2i)"].to_i, params[:schedule]["schedule_date(3i)"].to_i ) ;

    flash[:notice] = ""
    flash[:notice] += '日付が存在しません。<br />' if params[:schedule].blank? or !(Date.valid_date?( params[:schedule]["schedule_date(1i)"].to_i, params[:schedule]["schedule_date(2i)"].to_i, params[:schedule]["schedule_date(3i)"].to_i ))
    flash[:notice] += 'スケジュールデータが存在しません。<br />' if @schedule.blank?

    unless flash[:notice].blank?
      unless @schedule.blank?
        render :action => "edit", :id => @schedule.id, :date => @now_date
      else
        render :action => "edit", :date => @now_date
      end
      return
    end

    if @schedule.update_attributes( params[:schedule] )

SELECT * FROM "schedules" WHERE ("schedules"."id" = 3)
DELETE FROM "schedules" WHERE "id" = 3
---
  def destroy
    @now_date = Date.parse( params[:date] )
    @schedule = Schedule.find( params[:id] ) unless params[:id].blank?
    @schedule.destroy unless @schedule.blank?