app/controllers/schedules_controller.rb

  def show
    if params[:mode].to_s == "public" or session[:user_id].blank?
      @mode = "public"
    end

    @now_date = Date.parse( params[:date] )
    @schedule = Schedule.find( params[:id] ) unless params[:id].blank?
    @user = User.find_by_id( @schedule.user_id ) unless @schedule.blank?
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1